In [23]:
import pandas as pd

In [31]:
dir_ship_info = "./dataset/shop_info.txt"
dir_user_pay = "./dataset/user_pay.txt"
dir_user_view = "./dataset/user_view.txt"
shop_info = pd.read_csv(dir_ship_info, sep=',', names=["shop_id","city_name","location_id","per_pay","score","comment_cnt","shop_level","cate_1_name","cate_2_name","cate_3_name"])
user_pay = pd.read_csv(dir_user_pay, sep=",", names=["user_id","shop_id","time_stamp"])
user_view = pd.read_csv(dir_user_view, sep=",", names=["user_id","shop_id","time_stamp"])


dir_ouput= "./result.txt"
output=pd.DataFrame()
output.to_csv(dir_ouput, sep=",", names= ["shop_id","day1","..."])

In [25]:
shop_info.head()

,shop_id,city_name,location_id,per_pay,score,comment_cnt,shop_level,cate_1_name,cate_2_name,cate_3_name
0,1,湖州,885,8,4.0,12.0,2,美食,休闲茶饮,饮品/甜点
1,2,哈尔滨,64,19,NaN,NaN,1,超市便利店,超市,NaN
2,3,南昌,774,5,3.0,2.0,0,美食,休闲茶饮,奶茶
3,4,天津,380,18,NaN,NaN,1,超市便利店,超市,NaN
4,5,杭州,263,2,2.0,2.0,0,美食,休闲食品,生鲜水果

In [29]:
user_pay.head()

    user_id  shop_id           time_stamp
0  22127870     1862  2015-12-25 17:00:00
1   3434231     1862  2016-10-05 11:00:00
2  16955285     1862  2016-02-10 15:00:00
3  13799128     1862  2016-01-13 14:00:00
4  13799128     1862  2016-07-05 12:00:00

In [27]:
user_view.head()

    user_id  shop_id           time_stamp
0  13201967     1197  2016-10-21 18:00:00
1  19461365     1197  2016-06-28 23:00:00
2  15022321     1197  2016-07-16 19:00:00
3   5440872     1197  2016-07-15 07:00:00
4  12594529     1197  2016-08-07 16:00:00